<?php


function flash($status,$error){
	
$message=array(
	-1  => '系统错误',
	0   => '基本错误，根据模块而不同',
	1	=> '成功',
	2	=> '图片验证码错误',
	3	=> '短信验证码错误',
	
	97	=> '无效请求',
	98	=> '参数错误',
	99  => '系统错误，请稍后重试',
	101	=> '用户名格式不对',
	102	=> '用户名或密码不对，请重试',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',
	101	=> '',
	102	=> '',

);
	exit(json_encode(array('status'=>$status,'error'=>$messages[$error])));
}