<?php
/*
 *
 *	统一格式：A-BB-CC
 *	A:错误级别， 1代表数据库级错误;2代表系统级错误;3代表服务级错误;
 *	B:项目或模块名称，一般公司不会超过99个项目；
 *	C:
 *
 *
*/
 
	
$message=array(

	0   => '操作成功',
	
//  
	
// mysql 数据库: (10开头) 10+mysql 错误码

	102006 => '数据库连接失败',
	101002 => '数据库'

// 	系统级错误



// 服务级错误 started with 3

	// 验证 started with 301
	
		30101 => 'crsf_token 校验失败',
		30102 => '图片验证码失败'
		

		// 短信验证码
		30110 => '短信验证码失败'
		30111 => '短信验证码过期'
		
		// 各类格式错误
		30120 => '手机号码格式错误'
		30121 => '邮箱格式错误'
		30122 => '用户名格式错误'

		
	
	// 用户模块 started with 302
	
		//帐号密码错误
		30201 => '帐号密码错误'
		30202 => '帐号密码错误超过3次'
	


);
	 